{"id":14100,"date":"2017-09-05T07:15:41","date_gmt":"2017-09-05T11:15:41","guid":{"rendered":"https:\/\/www.sureoak.com\/?p=14100"},"modified":"2022-02-22T09:58:31","modified_gmt":"2022-02-22T14:58:31","slug":"ai-storytelling-lexi-mills","status":"publish","type":"post","link":"https:\/\/www.sureoak.com\/insights\/ai-storytelling-lexi-mills","title":{"rendered":"The Role of Artificial Intelligence in Storytelling: Lexi Mills"},"content":{"rendered":"<div class=\"fusion-fullwidth fullwidth-box fusion-builder-row-1 nonhundred-percent-fullwidth non-hundred-percent-height-scrolling\" style=\"background-color: rgba(255,255,255,0);background-position: center center;background-repeat: no-repeat;padding-top:0px;padding-right:0px;padding-bottom:0px;padding-left:0px;margin-bottom: 0px;margin-top: 0px;border-width: 0px 0px 0px 0px;border-color:#eae9e9;border-style:solid;\" ><div class=\"fusion-builder-row fusion-row\"><div class=\"fusion-layout-column fusion_builder_column fusion-builder-column-0 fusion_builder_column_1_1 1_1 fusion-one-full fusion-column-first fusion-column-last\" style=\"margin-top:0px;margin-bottom:0px;\"><div class=\"fusion-column-wrapper fusion-flex-column-wrapper-legacy\" style=\"background-position:left top;background-repeat:no-repeat;-webkit-background-size:cover;-moz-background-size:cover;-o-background-size:cover;background-size:cover;padding: 0px 0px 0px 0px;\"><div class=\"fusion-text fusion-text-1\"><p>We had a chance to sit down with Lexi Mills last week and ask her some questions ahead of her panel discussion at <a href=\"https:\/\/events.bizzabo.com\/205780\" target=\"_blank\" rel=\"noopener noreferrer\">The Future of Stories<\/a>.<\/p>\n<p>For more information about the upcoming event, take a look here:  <a href=\"https:\/\/events.bizzabo.com\/205780\" target=\"_blank\" rel=\"noopener noreferrer\">The Future of Stories:  The Role of Emotion in AI.<\/a><\/p>\n<p>Who is Lexi Mills? Lexi is a multi-award winning digital marketing expert, specializing in integrating PR and SEO &#8211; both at a strategic and tactical level. Her research work focuses on the opportunities, ethics, and risks of machine learning and AI within the sector of internet search. Lexi combines technical search algorithm knowledge and psychology to create data-driven measurable communications strategies that maximize influence on human behavior.<\/p>\n<p>Take a look our interview with Lexi.<\/p>\n<h3><a href=\"https:\/\/events.bizzabo.com\/205780\"><img class=\"lazyload alignright wp-image-14105 \" src=\"https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/future-of-stories-1024x397.jpg\" data-orig-src=\"https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/future-of-stories-1024x397.jpg\" alt=\"\" width=\"560\" height=\"217\" srcset=\"data:image\/svg+xml,%3Csvg%20xmlns%3D%27http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%27%20width%3D%27560%27%20height%3D%27217%27%20viewBox%3D%270%200%20560%20217%27%3E%3Crect%20width%3D%27560%27%20height%3D%27217%27%20fill-opacity%3D%220%22%2F%3E%3C%2Fsvg%3E\" data-srcset=\"https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/future-of-stories-200x77.jpg 200w, https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/future-of-stories-300x116.jpg 300w, https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/future-of-stories-400x155.jpg 400w, https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/future-of-stories-600x232.jpg 600w, https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/future-of-stories-768x297.jpg 768w, https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/future-of-stories-800x310.jpg 800w, https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/future-of-stories-1024x397.jpg 1024w, https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/future-of-stories.jpg 1180w\" data-sizes=\"auto\" data-orig-sizes=\"(max-width: 560px) 100vw, 560px\" \/><\/a>What is the role of emotion in AI?<\/h3>\n<p>When humans interact with AI, there are a couple of things to consider.<\/p>\n<p>The best interactions with humans and AI that I have seen come from the AI not being too human. A racy example but the research into AI and sex toys shows us that the current ‘optimum’ experiences tend to be when there are clear cues that the prospect we are interacting with is not fully human. We need things to be a little bit unfamiliar to be comfortable.<\/p>\n<p>When it comes to the role of AI and humans in a marketing context, I would argue that to split the roles for AI and humans, we need to work out who is going to perform highest in which area. Darwinian theory is all about survival of the fittest. We need to play to our strengths and allow AI to do the same.<\/p>\n<p>Humans are better at, well, being human, and AI is better at having super-computing analytical intelligence. I would feel better about using AI for its intelligence, and having humans using our human components of emotionality. Bringing the human component to AI will create new opportunities. And if you want AI’s “emotions” to be a reflection of humans, that can be insightful in storytelling.<\/p>\n<p>For example, take a data set and give it to an AI, and understand how its opinions, notions, and actions develop as a consequence that can create an experiential comprehension of your audience base as new research. Or at least the data that is shaping your audience.<\/p>\n<p>When it comes to storytelling, I would encourage the use of AI more to inform aspects of the story, the hooks, the trends, the questions being asked en mass about a subject and perhaps even the content to express these data points. How to weave this into an engaging story is harder for AI to currently do effectively, especially if it is a challenging subject. We find that the logical areas of the human brain shut down when we are in heightened emotional states, which are often key to being able to tell a ‘hard’ story and be heard.<\/p>\n<p>Even humans struggle with humor and the nuances of it have not yet been mastered by machine as such, and I would not be inclined to delegate that to AI at this point. Equally, we find people are inherently mistrustful of machines &#8211; even ones that are proven to be smarter and more intellectually reliable than humans. We also need to consider the impact of that on storytelling.<\/p>\n<p><iframe src=\"https:\/\/www.youtube.com\/embed\/AIlOftDfT8I?rel=0\" width=\"560\" height=\"315\" frameborder=\"0\" align=\"center\" allowfullscreen=\"allowfullscreen\"><\/iframe><\/p>\n<h3>How are advances in AI changing the shape of our role as content creators and media? If AI can do what humans used to do in the past, how does it change our roles as humans?<\/h3>\n<p>Let’s first flip the question:<\/p>\n<p>What is the role of humans in AI?<\/p>\n<p>Not just as a content marketer, but once we have AI that can do absolutely everything better than we can, what is the role of humans?<\/p>\n<p>What is the role of a content marketer here?<\/p>\n<p>A quick example to highlight the point.<\/p>\n<p>During World War II there was <a href=\"https:\/\/en.wikipedia.org\/wiki\/Charge_at_Krojanty\" target=\"_blank\" rel=\"noopener noreferrer\">the Charge at Krojanty<\/a>, where <a href=\"https:\/\/www.historyanswers.co.uk\/history-of-war\/john-riley-st-patricks-battalion-part-2-the-long-fight-for-freedom\/\" target=\"_blank\" rel=\"noopener noreferrer\">the Poles charged German tanks on horses<\/a>. They didn’t really stand a chance — horses against tanks. If you’re a journalist and other publications are using advanced AI to determine what to publish, and you’re not, then you’re like a horse going up against a tank — you’re probably not going to win.<\/p>\n<p>There may be certain circumstances that this might be different. In the Charge at Krojanty, the horses beat the tanks because all of the fuel in the tanks had frozen in the cold. If you’re not using tools that are more advanced than your competitors, you need to find a way to make this weakness a strength and turn your disadvantage into an advantage.<\/p>\n<h3>Do you think that the use of AI will be open and transparent by media?<\/h3>\n<p>No. I think it’s going to be kept under wraps for 2 reasons.<\/p>\n<p>Some people are not going to consider it artificial intelligence. They’re going to consider it an evolution of the tools they use to do their practice.<\/p>\n<p>If someone has developed something really valuable and advantageous, they’re not going to scream and shout about it and give every competitor a chance to copy it.<\/p>\n<p>As artificial intelligence increases its influence in media, what will be the relationship of PRs to the media?<\/p>\n<p>It has always been about getting coverage, and unfortunately we see that what gets more clicks often gets published. This means that we have more content designed to serve ‘clickability’ than perhaps ‘inform-ability’. We already see that time on page is dropping dramatically, as are concentration spans. From the studies I have seen, less than 70% of people read a whole article. We are being forced to tell stories in bite-sized forms. Which give retargeting technology a whole new place in modern storytelling.<\/p>\n<p>It might also be that media relationships and fluctuating temporary trends become more focused on determining which content to publish, rather than getting the content published itself. And this is true already today.<\/p>\n<p>The question keeps coming up:<\/p>\n<p>“How should we use technology to tell us what to cover, to understand our audience, and future plans for monetization?”<br \/>\n<a href=\"https:\/\/events.bizzabo.com\/205780\"><img class=\"lazyload wp-image-14105 aligncenter\" src=\"https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/future-of-stories-1024x397.jpg\" data-orig-src=\"https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/future-of-stories-1024x397.jpg\" alt=\"\" width=\"741\" height=\"287\" srcset=\"data:image\/svg+xml,%3Csvg%20xmlns%3D%27http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%27%20width%3D%27741%27%20height%3D%27287%27%20viewBox%3D%270%200%20741%20287%27%3E%3Crect%20width%3D%27741%27%20height%3D%27287%27%20fill-opacity%3D%220%22%2F%3E%3C%2Fsvg%3E\" data-srcset=\"https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/future-of-stories-200x77.jpg 200w, https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/future-of-stories-300x116.jpg 300w, https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/future-of-stories-400x155.jpg 400w, https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/future-of-stories-600x232.jpg 600w, https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/future-of-stories-768x297.jpg 768w, https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/future-of-stories-800x310.jpg 800w, https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/future-of-stories-1024x397.jpg 1024w, https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/future-of-stories.jpg 1180w\" data-sizes=\"auto\" data-orig-sizes=\"(max-width: 741px) 100vw, 741px\" \/><\/a><!-- end HubSpot Call-to-Action Code --><\/p>\n<h3>As AI has more of a role to play in online content, what are the greatest challenges we face in storytelling?<\/h3>\n<p>Consider this:<\/p>\n<p>Will AI actually make for better stories?<\/p>\n<p>Are story headlines that get more clicks great stories?<\/p>\n<p>I speak to a lot of journalists about the type of editing that happens to their articles. I was speaking to 2 journalists just last week, and they were both disgruntled on two separate occasions. They said that anytime they write something insightful and well thought out, it gets cut out. And the low-level anecdotes get published, because they get more clicks. They are more clickbaity. Whether it’s AI, analytics, or an editor’s awareness of what gets clicks, they know that the best stories aren’t going to get told if it doesn’t get clicks.<\/p>\n<p>However, as with all technological trends, I see this hitting a bursting point at least within certain sectors.<\/p>\n<p>What I’m seeing right now is that to a very large extent, any form of artificial intelligence and its relationship with mass media storytelling is bad at fueling better storytelling. It’s fueling better engagement in the short term. My view of advanced AI would be one that knows how to keep us reading and absorbing. Even better if it can get us to read things we find uncomfortable that are outside of our current filter bubbles.<\/p>\n<h3>What does this do to the human desire to want to read stories?<\/h3>\n<p>Maybe the role of AI in storytelling is to figure out how to get people to click on 3 or 4 things and tell them a story through their click experience as opposed to telling them a story through an article. Perhaps a story follows you across multiple platforms and even seeps into your friends feeds to fuel real life conversations.<\/p>\n<p>Perhaps we have to subvert the idea that a traditional written article is a story, and reconsider the message the we deliver it through, like interactive content or immersive theatre instead of just plain text. Music is a great example of this, despite the industry, struggling musicians still by my assessment garner the largest quantity of today&#8217;s most precious commodity, our attention.<\/p>\n<h3>What opportunities and challenges does AI create for online readers?<\/h3>\n<p>Artificial intelligence can make suggestions to you about something to read, try, buy, or do that you might have never even considered. But, you also need to convince the person to read that piece of content or engage with it.<\/p>\n<p>It might suggest to you something that you actually would really like, but perhaps due to social inhibitions you’d never go for it. Like what if it suggested to you, that you should put on pink ballet shoes and do ballet. Even if it knows that, and it’s true, from all of the data that you would actually love ballet. What are the chances that you’re actually going to walk into a ballet store and buy a pair of ballet shoes?<\/p>\n<p>Is it going to get smart enough to cross that bridge? What content do we have to create to cross that bridge?<\/p>\n<p>Could we suggest things to people that they would never normally consider? And how many times do we have to show them something brilliant that they’d love, to convert, to consume that one piece of content that will change their view on the world? And how do we do it? What content do we produce? How do we take them through that journey?<\/p>\n<p>The data shows us that we will trust our dumbest friend on Facebook, who we don’t even like, more than we would trust a high form of intelligence. Even if we knew it was smarter and the data is accurate.<\/p>\n<p>We would need to open up people’s minds and create trust with listening to AI. And the content marketers who can crack this is going to make a significant impact in this space, not just for businesses, but also for emerging technologies.<\/p>\n<p>Emerging technology has a real content and communication struggle. We can’t define a lot of it. We don’t even have the vocabulary in the English language to explain how and why someone would want to use this. This is especially true in the medical sector. There are phenomenal digital substitutes for many drugs but selling them is immensely challenging.<\/p>\n<p>For emerging technology, we need to:<\/p>\n<ul>\n<li>work out who can use and need artificial intelligence and why<\/li>\n<li>figure out how to convince people to trust AI, that the AI is helpful<\/li>\n<\/ul>\n<p>My firm is working hard on this problem and making progress with every data point we collect through both success and setbacks. These days I’m using a lot of data, and artificial intelligence sources, tools, and modeling to try and solve this problem. At every turn, we are folding people&#8217;s views and feedback into what we do. I have specifically sought out phenomenal storytellers that know nothing about tech or digital. If I can’t explain something I am working on to a friend or family member in a way they can understand and appreciate, that is the ultimate litmus test for knowing I need to go back to the drawing board.<\/p>\n<p>Funding will go where interest is. We already see this in early stage investing patterns. Unless we can bridge that gap, we will be slow to adopt and advance helpful new technology. I don’t think this is an unmanageable challenge and the opportunities unveiled by cracking it are incredibly exciting from both an economic and humanitarian perspective. Of course this tech could be used to sell things to those that don’t need or want. However, if advanced enough we should be able to match wants, needs and desires with providers better than ever before. That’s want I want to be part of.<\/p>\n<p>The greatest barrier to AI and human advancement will not be a technical one but a very human one. With every step we make acknowledge this, we take one to counter it.<\/p>\n<p><a href=\"https:\/\/events.bizzabo.com\/205780\"><img class=\"lazyload aligncenter size-full wp-image-14105\" src=\"https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/future-of-stories.jpg\" data-orig-src=\"https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/future-of-stories.jpg\" alt=\"\" width=\"1180\" height=\"457\" srcset=\"data:image\/svg+xml,%3Csvg%20xmlns%3D%27http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%27%20width%3D%271180%27%20height%3D%27457%27%20viewBox%3D%270%200%201180%20457%27%3E%3Crect%20width%3D%271180%27%20height%3D%27457%27%20fill-opacity%3D%220%22%2F%3E%3C%2Fsvg%3E\" data-srcset=\"https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/future-of-stories-200x77.jpg 200w, https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/future-of-stories-300x116.jpg 300w, https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/future-of-stories-400x155.jpg 400w, https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/future-of-stories-600x232.jpg 600w, https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/future-of-stories-768x297.jpg 768w, https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/future-of-stories-800x310.jpg 800w, https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/future-of-stories-1024x397.jpg 1024w, https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/future-of-stories.jpg 1180w\" data-sizes=\"auto\" data-orig-sizes=\"(max-width: 1180px) 100vw, 1180px\" \/><\/a><\/p>\n<h3>Lexi Mills<\/h3>\n<p><img class=\"lazyload alignleft size-medium wp-image-14118\" src=\"https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/lexi-mills-2-281x300.jpg\" data-orig-src=\"https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/lexi-mills-2-281x300.jpg\" alt=\"\" width=\"281\" height=\"300\" srcset=\"data:image\/svg+xml,%3Csvg%20xmlns%3D%27http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%27%20width%3D%27281%27%20height%3D%27300%27%20viewBox%3D%270%200%20281%20300%27%3E%3Crect%20width%3D%27281%27%20height%3D%27300%27%20fill-opacity%3D%220%22%2F%3E%3C%2Fsvg%3E\" data-srcset=\"https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/lexi-mills-2-200x214.jpg 200w, https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/lexi-mills-2-281x300.jpg 281w, https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/lexi-mills-2-400x428.jpg 400w, https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/lexi-mills-2-600x642.jpg 600w, https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/lexi-mills-2.jpg 650w\" data-sizes=\"auto\" data-orig-sizes=\"(max-width: 281px) 100vw, 281px\" \/>Lexi Mills is a multi-award winning digital marketing expert, with a focus on integrating PR and SEO at both a strategic and tactical level. She has built two international award-winning PR, SEO, Social Media &amp; content teams.<\/p>\n<p>Lexi combines technical search algorithm knowledge and psychology to create data-driven measurable communications strategies that maximize influence on human behavior. She applies this to external and internal communications alongside change management. Her research and journalism work focuses on her innovative tactics alongside the ethics, risks, and potential of machine learning and AI within the sector of internet search.<\/p>\n<p><a href=\"http:\/\/leximills.net\/\" target=\"_blank\" rel=\"noopener noreferrer\">Learn more about Lexi Mills.<\/a><\/p>\n<p><a href=\"https:\/\/twitter.com\/leximills?lang=en\" target=\"_blank\" rel=\"noopener noreferrer\">Follow Lexi on Twitter.<\/a><\/p>\n<\/div><div class=\"fusion-clearfix\"><\/div><\/div><\/div><\/div><\/div>\n","protected":false},"excerpt":{"rendered":"<p>Who is Lexi Mills? Lexi is a multi-award winning digital marketing expert, specializing in integrating PR and SEO &#8211; both at a strategic and tactical level. Her research work&#8230;<\/p>\n","protected":false},"author":2,"featured_media":19479,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[6],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>The Role of Artificial Intelligence in Storytelling: Lexi Mills - Sure Oak<\/title>\n<meta name=\"description\" content=\"Lexi Mills is a multi-award winning digital marketing expert. We asked her about the role of artificial intelligence in storytelling. Read the interview!\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.sureoak.com\/insights\/ai-storytelling-lexi-mills\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"The Role of Artificial Intelligence in Storytelling: Lexi Mills - Sure Oak\" \/>\n<meta property=\"og:description\" content=\"Lexi Mills is a multi-award winning digital marketing expert. We asked her about the role of artificial intelligence in storytelling. Read the interview!\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.sureoak.com\/insights\/ai-storytelling-lexi-mills\" \/>\n<meta property=\"og:site_name\" content=\"Sure Oak SEO\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/SureOak\/\" \/>\n<meta property=\"article:published_time\" content=\"2017-09-05T11:15:41+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-02-22T14:58:31+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/role-artificial-intelligence-1.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"353\" \/>\n\t<meta property=\"og:image:height\" content=\"176\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@sureoak\" \/>\n<meta name=\"twitter:site\" content=\"@sureoak\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Tom Casano\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"12 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.sureoak.com\/#website\",\"url\":\"https:\/\/www.sureoak.com\/\",\"name\":\"Sure Oak SEO\",\"description\":\"Rank Higher, Grow Your Revenue\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.sureoak.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.sureoak.com\/insights\/ai-storytelling-lexi-mills#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/role-artificial-intelligence-1.jpg\",\"contentUrl\":\"https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/role-artificial-intelligence-1.jpg\",\"width\":353,\"height\":176,\"caption\":\"role-artificial-intelligence\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.sureoak.com\/insights\/ai-storytelling-lexi-mills#webpage\",\"url\":\"https:\/\/www.sureoak.com\/insights\/ai-storytelling-lexi-mills\",\"name\":\"The Role of Artificial Intelligence in Storytelling: Lexi Mills - Sure Oak\",\"isPartOf\":{\"@id\":\"https:\/\/www.sureoak.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.sureoak.com\/insights\/ai-storytelling-lexi-mills#primaryimage\"},\"datePublished\":\"2017-09-05T11:15:41+00:00\",\"dateModified\":\"2022-02-22T14:58:31+00:00\",\"author\":{\"@id\":\"https:\/\/www.sureoak.com\/#\/schema\/person\/3261b9cd698d84b89b84efb4f90161f9\"},\"description\":\"Lexi Mills is a multi-award winning digital marketing expert. We asked her about the role of artificial intelligence in storytelling. Read the interview!\",\"breadcrumb\":{\"@id\":\"https:\/\/www.sureoak.com\/insights\/ai-storytelling-lexi-mills#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.sureoak.com\/insights\/ai-storytelling-lexi-mills\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.sureoak.com\/insights\/ai-storytelling-lexi-mills#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.sureoak.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"The Role of Artificial Intelligence in Storytelling: Lexi Mills\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.sureoak.com\/#\/schema\/person\/3261b9cd698d84b89b84efb4f90161f9\",\"name\":\"Tom Casano\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.sureoak.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/d047741707ad2288ab514adfb5e793f9?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/d047741707ad2288ab514adfb5e793f9?s=96&d=mm&r=g\",\"caption\":\"Tom Casano\"},\"url\":\"https:\/\/www.sureoak.com\/insights\/author\/tom\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"The Role of Artificial Intelligence in Storytelling: Lexi Mills - Sure Oak","description":"Lexi Mills is a multi-award winning digital marketing expert. We asked her about the role of artificial intelligence in storytelling. Read the interview!","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.sureoak.com\/insights\/ai-storytelling-lexi-mills","og_locale":"en_US","og_type":"article","og_title":"The Role of Artificial Intelligence in Storytelling: Lexi Mills - Sure Oak","og_description":"Lexi Mills is a multi-award winning digital marketing expert. We asked her about the role of artificial intelligence in storytelling. Read the interview!","og_url":"https:\/\/www.sureoak.com\/insights\/ai-storytelling-lexi-mills","og_site_name":"Sure Oak SEO","article_publisher":"https:\/\/www.facebook.com\/SureOak\/","article_published_time":"2017-09-05T11:15:41+00:00","article_modified_time":"2022-02-22T14:58:31+00:00","og_image":[{"width":353,"height":176,"url":"https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/role-artificial-intelligence-1.jpg","type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_creator":"@sureoak","twitter_site":"@sureoak","twitter_misc":{"Written by":"Tom Casano","Est. reading time":"12 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.sureoak.com\/#website","url":"https:\/\/www.sureoak.com\/","name":"Sure Oak SEO","description":"Rank Higher, Grow Your Revenue","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.sureoak.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/www.sureoak.com\/insights\/ai-storytelling-lexi-mills#primaryimage","inLanguage":"en-US","url":"https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/role-artificial-intelligence-1.jpg","contentUrl":"https:\/\/www.sureoak.com\/wp-content\/uploads\/2017\/09\/role-artificial-intelligence-1.jpg","width":353,"height":176,"caption":"role-artificial-intelligence"},{"@type":"WebPage","@id":"https:\/\/www.sureoak.com\/insights\/ai-storytelling-lexi-mills#webpage","url":"https:\/\/www.sureoak.com\/insights\/ai-storytelling-lexi-mills","name":"The Role of Artificial Intelligence in Storytelling: Lexi Mills - Sure Oak","isPartOf":{"@id":"https:\/\/www.sureoak.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.sureoak.com\/insights\/ai-storytelling-lexi-mills#primaryimage"},"datePublished":"2017-09-05T11:15:41+00:00","dateModified":"2022-02-22T14:58:31+00:00","author":{"@id":"https:\/\/www.sureoak.com\/#\/schema\/person\/3261b9cd698d84b89b84efb4f90161f9"},"description":"Lexi Mills is a multi-award winning digital marketing expert. We asked her about the role of artificial intelligence in storytelling. Read the interview!","breadcrumb":{"@id":"https:\/\/www.sureoak.com\/insights\/ai-storytelling-lexi-mills#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.sureoak.com\/insights\/ai-storytelling-lexi-mills"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.sureoak.com\/insights\/ai-storytelling-lexi-mills#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.sureoak.com\/"},{"@type":"ListItem","position":2,"name":"The Role of Artificial Intelligence in Storytelling: Lexi Mills"}]},{"@type":"Person","@id":"https:\/\/www.sureoak.com\/#\/schema\/person\/3261b9cd698d84b89b84efb4f90161f9","name":"Tom Casano","image":{"@type":"ImageObject","@id":"https:\/\/www.sureoak.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/d047741707ad2288ab514adfb5e793f9?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/d047741707ad2288ab514adfb5e793f9?s=96&d=mm&r=g","caption":"Tom Casano"},"url":"https:\/\/www.sureoak.com\/insights\/author\/tom"}]}},"_links":{"self":[{"href":"https:\/\/www.sureoak.com\/wp-json\/wp\/v2\/posts\/14100"}],"collection":[{"href":"https:\/\/www.sureoak.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.sureoak.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.sureoak.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.sureoak.com\/wp-json\/wp\/v2\/comments?post=14100"}],"version-history":[{"count":1,"href":"https:\/\/www.sureoak.com\/wp-json\/wp\/v2\/posts\/14100\/revisions"}],"predecessor-version":[{"id":28329,"href":"https:\/\/www.sureoak.com\/wp-json\/wp\/v2\/posts\/14100\/revisions\/28329"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.sureoak.com\/wp-json\/wp\/v2\/media\/19479"}],"wp:attachment":[{"href":"https:\/\/www.sureoak.com\/wp-json\/wp\/v2\/media?parent=14100"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.sureoak.com\/wp-json\/wp\/v2\/categories?post=14100"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.sureoak.com\/wp-json\/wp\/v2\/tags?post=14100"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}